dummy-buoyantPimple-T/fluid-openfoam/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [ 1 -1 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    upperWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    lowerWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}
