dummy-buoyantPimple-T/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           ();
    cellSets          (box1);
    locations         volumeCenters;
    
    readData
    (
      Temperature
    );
    
    writeData
    (
    );
  };
};
